Revit 2027 API
ProjectInfo.Address Property
Get or Set the Project Address of the Project Information.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Address { get; set; }
Public Property Address As String
	Get
	Set
public:
property String^ Address {
	String^ get ();
	void set (String^ value);
}
member Address : string with get, set
Property Value
String
Remarks
This property is used to get or set the Project Address of the Project Information.
See Also
Reference
ProjectInfo Class
Autodesk.Revit.DB Namespace